tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
# brew "cairo" #macos only
brew "cocoapods" #macos only
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gpg"
brew "imagemagick@6", link: true
brew "jq"
brew "lame"
brew "libav"
brew "logrotate", restart_service: true
brew "luajit"
brew "mysql-client"
brew "node@10", link: true # do I need this with NVM anymore?
brew "postgresql", restart_service: true
brew "rbenv"
brew "sox"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "wget"
brew "github/gh/gh"
brew "heroku/brew/heroku"
brew "thoughtbot/formulae/gitsh" #macos only
cask "font-hack-nerd-font" # macos only
cask "font-victor-mono" # macos only
cask "iterm2" # macos only
