# `brew tap ...`
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"

# `brew install ...`
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gpg"
brew "imagemagick@6", link: true
brew "jq"
brew "lame"
brew "logrotate", restart_service: true
brew "luajit"
brew "mysql-client"
brew "pinentry-mac" if OS.mac?
brew "postgresql@15", restart_service: true
brew "rbenv"
brew "sox"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "wget"

brew "heroku/brew/heroku"
brew "cairo" if OS.mac?
brew "cocoapods" if OS.mac?
brew "mas" if OS.mac?
brew "thoughtbot/formulae/gitsh" if OS.mac?

# `brew install --cask ...`
cask "asana" if OS.mac?
cask "fantastical" if OS.mac?
cask "firefox" if OS.mac?
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-victor-mono"
cask "iterm2" if OS.mac?
cask "keybase" if OS.mac?
cask "nordvpn" if OS.mac?
cask "notion" if OS.mac?
cask "obsidian" if OS.mac?
cask "raycast" if OS.mac?
cask "rectangle" if OS.mac?
cask "setapp" if OS.mac?
cask "slack" if OS.mac?
cask "spotify" if OS.mac?
cask "tuple" if OS.mac?
cask "warp" if OS.mac?
cask "zoom" if OS.mac?
cask "1password" if OS.mac?

# `mas install ...`
mas "Apple Configurator", id: 1037126344
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498
mas "Xcode", id: 497799835
