tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "thoughtbot/formulae"
brew "cairo" if OS.mac?
brew "cocoapods" if OS.mac?
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "gpg"
brew "imagemagick@6", link: true
brew "jq"
brew "lame"
brew "libav"
brew "logrotate", restart_service: true
brew "luajit"
brew "mysql-client"
brew "postgresql", restart_service: true
brew "rbenv"
brew "sox"
brew "the_silver_searcher"
brew "tmux"
brew "vim"
brew "watchman"
brew "wget"
brew "heroku/brew/heroku"
brew "thoughtbot/formulae/gitsh" if OS.mac?
cask "asana" if OS.mac?
cask "font-hack-nerd-font"
cask "font-victor-mono"
cask "iterm2" if OS.mac?
cask "raycast" if OS.mac?
cask "warp" if OS.mac?
