# macos-specific

# `brew tap ...`
# tap "heroku/brew" # personal-only
tap "thoughtbot/formulae"
tap "xcodesorg/made"

# `brew install ...`
brew "cairo"
brew "cocoapods"
brew "direnv"
brew "mas"
brew "pinentry-mac"
# brew "heroku/brew/heroku" # personal-only
brew "thoughtbot/formulae/gitsh"
brew "xcodesorg/made/xcodes"

# `brew install --cask ...`
cask "asana" if OS.mac? # work-only
cask "betterdisplay" if OS.mac?
cask "cleanshot" if OS.mac?
cask "cursor" if OS.mac?
cask "fantastical" if OS.mac?
cask "firefox" if OS.mac?
cask "font-hack-nerd-font"
cask "font-victor-mono"
cask "ghostty" if OS.mac?
cask "iterm2" if OS.mac?
cask "keybase" if OS.mac? # work-only
cask "nordlayer" if OS.mac? # work-only
cask "notion" if OS.mac? # work-only
cask "obsidian" if OS.mac?
cask "raycast" if OS.mac?
cask "rapidapi" if OS.mac?
cask "slack" if OS.mac?
cask "spotify" if OS.mac?
cask "tuple" if OS.mac? # work-only
cask "visual-studio-code" if OS.mac?
cask "warp" if OS.mac?
cask "zoom" if OS.mac? # work-only
cask "1password" if OS.mac?
cask "1password-cli" if OS.mac?

# `mas install ...`
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "Bear", id: 1091189122
mas "Day One", id: 1055511498 # personal-only
