# brew bundle --no-upgrade --file=./profiles/work/Brewfile

# `brew tap ...`
tap "datadog-labs/pack"
tap "xcodesorg/made"

# `brew install ...`
brew "cairo" # Vector graphics library with cross-device output support - apparently needed for Prince Serverless
brew "cocoapods" # Dependency manager for for Cocoa projects - CCA
brew "datadog-labs/pack/pup" # Go-based command-line wrapper for easy interaction with Datadog APIs
brew "xcodes" # Best command-line tool to install and switch between multiple versions of Xcode

# `brew install --cask ...`
cask "asana"
cask "betterdisplay"
cask "nordlayer"
cask "notion"
cask "slack"
cask "tuple"
cask "zoom"
cask "elgato-camera-hub"
cask "granola"
cask "shureplus-motiv"

# `mas install ...`
mas "iA Presenter", id: 6746414429
