# brew bundle --no-upgrade --file=./profiles/common/Brewfile

# `brew tap ...`
tap "github/gh"
tap "jesseduffield/lazygit"
tap "manaflow-ai/cmux"

# `brew install ...`
brew "direnv"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-lfs"
brew "go"
brew "lazygit"
brew "mas"
brew "mdserve"
brew "lua"
brew "neovim"
brew "node"
brew "python"
brew "ripgrep"
brew "the_silver_searcher"
brew "pam-reattach"
brew "tmux"

# `brew install --cask ...`
cask "arc"
cask "claude"
cask "cleanshot"
cask "fantastical"
cask "font-jetbrains-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-victor-mono"
cask "ghostty"
cask "obsidian"
cask "raycast"
cask "rapidapi"
cask "spotify"
cask "bartender"
cask "1password"
cask "1password-cli"
cask "cmux"

# `mas install ...`
mas "Amphetamine", id: 937984704
mas "Apple Configurator", id: 1037126344
mas "iA Writer", id: 775737590
mas "RadarScope", id: 288419283
mas "Things 3", id: 904280696
